
<html>
    <head>
        
        <title>Sortieralgorithmen-Johannes Adelmann</title>
        <meta content="text/html; charset=utf-8">
        <meta name="viewport" content="width=device-width, initial-scale=1">
        <link rel="stylesheet" href="../styles/index.css">
        <link rel="stylesheet" href="../styles/general.css">
        <link rel="stylesheet" href="../styles/impressum.css">
        
        <script type="text/javascript" src="../scripts/index.js"></script>
    </head>
    <body>
        <section class="topSection">
            <div id="logo"><a href="../docs/index.html"><img src="../images/Logomakr_0wq3o5.png"></a></div>
            <div id="topMiddle">
                <nav class="menu">
                    <ul>
                        <li><a href="#">Langsam</a>
                            <ul>
                                <li><a href="bubbleSort.html">Bubblesort</a></li>
                                <li><a href="selectionSort.html">Selectionsort</a></li>
                                <li><a href="insertionSort.html">Insertionsort</a></li>
                            </ul>
                        </li>    
                        <li><a href="#">Schnell</a>
                            <ul>
                                <li><a href="mergeSort.html">Mergesort</a></li>
                                <li><a href="quickSort.html">Quicksort</a></li>
                            </ul> 
                        </li>
                        <li><a href="/docs/vlab.html">Versuchslabor</a></li>
                        <li><a href="../docs/impressum.html">Impressum</a></li>
                    </ul>
                </nav>
            </div>
            <div id="topRight"></div>
        </section>
        
        <section class="middleSection">
            <h1>Impressum</h1> 
            <h2>Angaben gemäß &sect; 5 TMG:</h2> 
            <p>Diese Seite wurde erstellt von<span class="blueText"> Johannes Adelmann</span> <br /> </p> 
            <h2>Kontakt:</h2> Adelmann@students.uni-marburg.de
            <h1>Haftungsausschluss (Disclaimer)</h1> 
            <h2>Haftung für Inhalte</h2> 
            <p>Als Diensteanbieter bin ich gem&auml;&szlig; &sect; 7 Abs.1 TMG f&uuml;r eigene Inhalte auf diesen Seiten nach den allgemeinen
                Gesetzen verantwortlich. <br> Nach &sect;&sect; 8 bis 10 TMG bin ich als Diensteanbieter jedoch nicht verpflichtet,
                &uuml;bermittelte oder gespeicherte fremde Informationen zu &uuml;berwachen <br> oder nach Umst&auml;nden zu
                forschen, die auf eine rechtswidrige T&auml;tigkeit hinweisen.</p> 
            <p>Verpflichtungen zur Entfernung oder
                Sperrung der Nutzung von Informationen nach den allgemeinen Gesetzen bleiben hiervon unber&uuml;hrt. <br> Eine
                diesbez&uuml;gliche Haftung ist jedoch erst ab dem Zeitpunkt der Kenntnis einer konkreten Rechtsverletzung
                m&ouml;glich. <br> Bei Bekanntwerden von entsprechenden Rechtsverletzungen werde ich diese Inhalte umgehend
                entfernen.</p>
            <h2>Urheberrecht</h2> 
            <p>Die durch den Seitenbetreiber
                erstellten Inhalte und Werke auf diesen Seiten unterliegen dem deutschen Urheberrecht. <br> Die
                Vervielf&auml;ltigung, Bearbeitung, Verbreitung und jede Art der Verwertung au&szlig;erhalb der Grenzen des
                Urheberrechtes <br> bed&uuml;rfen der schriftlichen Zustimmung des jeweiligen Autors bzw. Erstellers. <br> Downloads
                und Kopien dieser Seite sind nur f&uuml;r den privaten, nicht kommerziellen Gebrauch gestattet.</p> <p>Soweit
                die Inhalte auf dieser Seite nicht vom Betreiber erstellt wurden, werden die Urheberrechte Dritter beachtet. <br>
                Insbesondere werden Inhalte Dritter als solche gekennzeichnet. <br> Sollten Sie trotzdem auf eine
                Urheberrechtsverletzung aufmerksam werden, bitte ich um einen entsprechenden Hinweis. <br> Bei Bekanntwerden
                von Rechtsverletzungen werde ich derartige Inhalte umgehend entfernen.</p><p>&nbsp;</p>
            <h2>Cookies</h2>
            <p>Die Internetseiten verwenden teilweise so genannte Cookies. Cookies richten auf Ihrem
                Rechner keinen Schaden an und enthalten keine Viren. <br> Cookies dienen dazu, mein Angebot nutzerfreundlicher,
                effektiver und sicherer zu machen. <br> Cookies sind kleine Textdateien, die auf Ihrem Rechner abgelegt werden und
                die Ihr Browser speichert.</p>  <p>Die meisten der von mir verwendeten Cookies sind so genannte „Session-
            Cookies“. Sie werden nach Ende Ihres Besuchs automatisch gel&ouml;scht. <br> Andere Cookies bleiben auf Ihrem
            Endger&auml;t gespeichert, bis Sie diese l&ouml;schen. Diese Cookies erm&ouml;glichen es mir, <br> Ihren Browser
            beim n&auml;chsten Besuch wiederzuerkennen.</p> <p>Sie k&ouml;nnen Ihren Browser so einstellen, dass Sie
            &uuml;ber das Setzen von Cookies informiert werden und Cookies nur im Einzelfall erlauben, <br> die Annahme von
            Cookies f&uuml;r bestimmte F&auml;lle oder generell ausschlie&szlig;en sowie das automatische L&ouml;schen
            der Cookies beim Schlie&szlig;en des Browser aktivieren. <br> Bei der Deaktivierung von Cookies kann die
            Funktionalit&auml;t dieser Website eingeschr&auml;nkt sein.</p><p>&nbsp;</p>
            <p>
                Circle graphic by <a href="http://www.flaticon.com/authors/freepik">Freepik</a> from <a href="http://www.flaticon.com/">Flaticon</a> is licensed under <a href="http://creativecommons.org/licenses/by/3.0/" title="Creative Commons BY 3.0">CC BY 3.0</a>. Made with <a href="http://logomakr.com" title="Logo Maker">Logo Maker</a>
            </p>
        </section>
        
        <footer class="bottomSection">
            <div id="time"></div>
        </footer>
    </body>
</html>